{
    "DeckName": "VRWL",

    "DeckBy": "Ozou",

    "Truths": [
    "Have you ever accidentally given someone a wedgie? What happened?",

    "What’s the funniest reaction you’ve had when you received a wedgie?", 

    "Have you ever gotten a wedgie in public? What was your response?", 

    "What’s the most creative way you’ve seen someone give a wedgie?", 

    "Have you ever gotten a wedgie from a friend as a prank? How did you react?", 

    "What’s the worst wedgie you’ve ever had to endure?", 

    "Do you think giving someone a wedgie is funny or cruel? Why?", 

    "Have you ever gotten revenge after receiving a wedgie? How?", 

    "What’s the worst place to receive a wedgie?", 

    "Have you ever been the victim of a wedgie prank at school or work?", 

    "What’s the funniest excuse you’ve given for getting a wedgie in public?", 

    "Have you ever witnessed a wedgie gone wrong? What happened?", 

    "Have you ever received a wedgie from someone you had a crush on?", 

    "Would you ever give a wedgie to someone you like, as a playful flirt?", 

    "Would you prefer to receive a wedgie from someone playful or romantic?", 

    "What’s the flirtiest thing someone has done to you after giving you a wedgie?", 

    "Would you ever prank someone with a wedgie, or do you think it’s too bold?", 

    "What’s the most flirty thing you would say while giving someone a wedgie?", 

    "Do you think wedgies can be a funny way to flirt?", 

    "If you had to pick one person to give a wedgie to in the group, who would it be?", 

    "Have you ever flirted with someone right after giving them a wedgie?", 

    "If you were to prank someone with a wedgie, would you follow it up with a flirty gesture?", 

    "What’s the funniest thing that’s happened while flirting after a wedgie prank?", 

    "Would you ever give someone a wedgie as part of a flirty game?", 

    "Have you ever secretly wanted to give someone a wedgie but didn’t have the courage?", 

    "What’s the most awkward situation you’ve found yourself in after receiving a wedgie?", 

    "What’s the weirdest thing you’ve ever done to avoid getting a wedgie?", 

    "What’s your reaction when someone gives you a wedgie without warning?", 

    "Have you ever tried to get revenge for a wedgie, but it didn’t go as planned?", 

    "What’s the craziest prank someone has pulled involving a wedgie?", 

    "What’s something you’ve done to “fix” a wedgie that ended up making it worse?", 

    "Have you ever pretended you didn’t get a wedgie because you were too embarrassed?", 

    "What’s the biggest wedgie you’ve ever given someone, and how did they react?", 

    "Have you ever been too shy to ask for help with a wedgie? What did you do?", 

    "Have you ever received a wedgie from someone in the most unexpected place or situation?", 

    "What’s the craziest thing you’ve done to get revenge on someone for giving you a wedgie?", 

    "f you had to choose one person to give you a wedgie, who would it be?", 

    "Would you ever do something embarrassing in exchange for a wedgie prank?", 

    "Do you secretly find wedgies funny, even though they’re a little painful?", 

    "Have you ever been in a situation where you didn’t realize you were getting a wedgie until it was too late?", 

    "Have you ever given someone a wedgie just to see how they’d react?", 

    "ave you ever gotten a wedgie from someone who didn’t know you well, and how did it feel?", 

    "Would you consider giving a wedgie to someone as part of a prank war?", 

    "What’s the most extreme wedgie situation you’ve ever been in?", 

    "What’s something embarrassing that happened to you after getting a wedgie?", 

    "What’s the most awkward or painful wedgie you’ve ever had?", 

    "Have you ever had a wedgie during a formal event or presentation? How did you handle it?", 

    "Have you ever tried to get out of a wedgie secretly but ended up drawing attention to it?", 

    "What’s the funniest prank involving wedgies you’ve ever witnessed?", 

    "If you could prank anyone with a wedgie, who would it be, and how would you do it?", 

    "What’s something embarrassing you’ve done because you were trying to hide a wedgie?", 

    "Have you ever had a wedgie during a date or important event? What happened?", 

    "Have you ever seen a wedgie prank go too far? What happened?", 

    "What’s the most creative way you’ve ever avoided a wedgie?", 

    "Have you ever gotten a wedgie from a sibling? How did they get you?", 

    "Have you ever gotten revenge on someone for giving you a wedgie? How did you do it?", 

    "If you had to choose between getting a wedgie or pranking someone with a wedgie, what would you choose?", 

    "Have you ever received a wedgie at a completely unexpected moment? How did it happen?", 

    "What’s your strategy for avoiding wedgies in a playful situation?", 

    "What’s the most unexpected place you’ve ever gotten a wedgie?", 

    "Have you ever tried to give someone a wedgie and completely failed?", 

    "What’s the funniest thing you’ve heard someone say while they were getting a wedgie?", 

    "What’s the longest amount of time you’ve ever had to suffer through a wedgie?", 

    "Have you ever received a wedgie during a completely serious situation, like a meeting or ceremony?", 

    "Have you ever had someone get you with a wedgie and you didn’t even see it coming?", 

    "What’s the funniest way you’ve ever gotten out of a wedgie situation?", 

    "Have you ever intentionally given someone a wedgie just for the laughs?", 

    "What’s the most awkward thing you’ve done after receiving a wedgie in public?", 

    "If you could give a wedgie to anyone in the room, who would it be and why?", 

    "What’s the weirdest excuse you’ve given for getting a wedgie?", 

    "Have you ever received a wedgie from someone while they were trying to be funny but ended up embarrassing themselves?", 

    "Have you ever given someone a wedgie because you had a crush on them?", 

    "Would you ever consider giving a wedgie as part of a flirty game or ?", 

    "What’s the most flirtatious thing someone has done to you after giving you a wedgie?", 

    "If someone cute gave you a wedgie, how would you react?", 

    "Have you ever tried to “flirt” your way out of a wedgie situation?", 

    "What’s the best way to flirt with someone after giving them a wedgie?", 

    "If someone flirted with you while giving you a wedgie, would you find it cute or annoying?", 

    "Would you ever give a wedgie to someone you like to see their reaction?", 

    "Do you think wedgies can be a funny way to flirt with someone?", 

    "If you were to give a wedgie to someone you liked, what would you say right after?", 

    "Have you ever made a joke about wedgies while flirting with someone?", 

    "Would you ever give someone a wedgie as a sign of affection or flirtation?", 

    "Have you ever gotten caught giving or receiving a wedgie in a public place? What happened?", 

    "What’s the most embarrassing thing that has happened to you after getting a wedgie?", 

    "Have you ever lied about receiving a wedgie to avoid embarrassment?", 

    "Have you ever been the victim of a wedgie prank that you were totally unprepared for?", 

    "What’s something you’ve done to avoid getting a wedgie, but it backfired?", 

    "Have you ever secretly gotten a wedgie and acted like it didn’t bother you?", 

    "What’s the worst way you’ve ever received a wedgie—unexpected and unplanned?", 

    "Have you ever gotten a wedgie and not been able to stop laughing, even though you were embarrassed?", 

    "What’s your worst “revenge” story after someone gave you a wedgie?", 

    "What’s the most outrageous reaction you’ve had after getting a wedgie?", 

    "Have you ever blamed someone else for your wedgie just to save face?", 

    "Have you ever received a wedgie that left you stuck in a position for too long?", 

    "What’s the worst possible time for you to get a wedgie?", 

    "Have you ever tried to prank someone with a wedgie but it didn’t work out as planned?", 

    "If you could get a wedgie from any celebrity, who would it be and why?", 

    "Would you rather receive a wedgie or get a pie to the face? Why?", 

    "If someone got you with a wedgie and you didn’t expect it, how would you react?", 

    "Have you ever been caught trying to escape from a wedgie situation?", 

    "Have you ever had someone prank you with a wedgie during a serious event?", 

    "Have you ever gotten a wedgie from someone you didn’t even know that well?", 

    "What’s the craziest place you’ve received a wedgie?", 

    "Have you ever witnessed someone give a wedgie and thought it was hilarious but didn’t laugh out loud?", 

    "Would you rather give a wedgie to someone you like or prank them with something else?", 

    "Have you ever tried to talk your way out of receiving a wedgie? Did it work?", 

    "What’s the silliest thing you’ve done to avoid getting a wedgie?", 

    "Would you rather give or receive a wedgie as part of a prank? Why?", 

    "Have you ever gotten a wedgie and then tried to act like it didn’t bother you?", 

    "What’s your worst “wedgie” moment that you never want to repeat?", 

    "Would you be able to take a wedgie and laugh it off, or would you be embarrassed?", 

    "Have you ever witnessed a wedgie that went too far and turned into a real fight?", 

    "Have you ever been part of a prank war that involved wedgies? What happened?", 

    "Would you ever prank someone with a wedgie if you knew they could take it?", 

    "What’s the worst reaction you’ve had to getting a wedgie?", 

    "Have you ever had a wedgie so bad you had to stop what you were doing to fix it?", 

    "Would you rather get a wedgie every time you lose a game or win a prize every time you get one?", 

    "What’s the best way to get back at someone who gave you a wedgie?", 

    "Have you ever received a wedgie that made you rethink your life choices?", 

    "What was your most creative excuse for why you couldn’t give someone a wedgie?", 

    "Would you ever agree to a wedgie contest where the loser has to wear the wedgie the longest?", 

    "Have you ever gotten a wedgie in a place where you had to act cool about it?", 

    "Who in this group would handle a wedgie the worst?", 

    "Have you ever been the victim of a wedgie prank that caught you completely off guard?", 

    "What is your strategy for getting out of a wedgie without anyone noticing?", 

    "Would you be willing to give someone a wedgie in exchange for a dare?", 

    "What do you think would be the worst possible time to receive a wedgie?", 

    "Have you ever tried to give someone a wedgie but failed?", 

    "What would your reaction be if you were given a wedgie during an important meeting?", 

    "Would you ever dare to give someone a wedgie during a live performance?", 

    "What is your worst memory involving a wedgie and public embarrassment?", 

    "Have you ever tried to give yourself a wedgie for fun and ended up regretting it?", 

    "What is the weirdest place you’ve received a wedgie?", 

    "Would you give someone a wedgie if they were wearing their best clothes?", 

    "Have you ever given someone a wedgie just to make them laugh?", 

    "What would be your reaction if someone gave you a wedgie in front of your crush?", 

    "Have you ever tried to get out of a wedgie by pretending it doesn’t bother you?", 

    "What would you do if someone gave you a wedgie while you were in the middle of a workout?", 

    "Have you ever laughed at someone when they got a wedgie, even though you knew it was painful?", 
    
    "Would you ever let someone give you a wedgie if it meant you’d win a prize?", 
    
    "Have you ever given someone a wedgie as part of a prank war?", 
    
    "What’s the funniest thing that’s happened while someone was getting a wedgie?", 
    
    "Would you ever give someone a wedgie just to mess with them in front of your friends?", 
    
    "Have you ever received a wedgie and didn’t realize how bad it was until later?", 
    
    "What’s the longest you’ve worn a wedgie before being able to fix it?", 
    
    "Would you ever get revenge on someone with a wedgie if they pranked you?", 
    
    "What do you think is the best strategy for surviving a wedgie without it being too embarrassing?", 
    
    "Have you ever received a wedgie in a very inappropriate or awkward setting?", 
    
    "What would be your ideal reaction to receiving a wedgie at a wedding or other serious event?", 
    
    "Would you ever give a wedgie to a stranger if they asked you to?", 
    
    "What is your worst wedgie-related injury?", 
    
    "Would you ever give someone a wedgie to impress someone else?", 
    
    "Have you ever gotten a wedgie and acted like it didn’t hurt, even though it did?", 
    
    "What do you think is the worst possible time to give someone a wedgie?", 
    
    "Have you ever tried to fix a wedgie while pretending you were doing something else?", 
    
    "Would you ever volunteer to give someone a wedgie as part of a game?", 
    
    "What’s your strategy for avoiding getting a wedgie at a party?", 
    
    "Haveyou ever given someone a wedgie just to see how they would react?", 

    "Haveyou ever secretly wished you could give someone a wedgie?", 
    
    "Would you ever let someone give you a wedgie if it meant winning a huge prize?", 
    
    "Have you ever been in a situation where you had to give a wedgie to avoid being pranked?", 
    
    "What would be your reaction if someone gave you a wedgie while you were on a date?", 
    
    "Have you ever gotten a wedgie that was so bad you had to change clothes?", 
    
    "Would you ever ask someone to give you a wedgie as a dare?", 
    
    "Haveyou ever given someone a wedgie to settle a bet?", 
    
    "What would you do if someone gave you a wedgie while you were wearing new clothes?", 
    
    "Have you ever been embarrassed after giving someone a wedgie?", 
    
    "Would you ever get a wedgie from someone you didn’t know as part of a social experiment?", 
    
    "What is the most creative reason you’ve heard for someone giving someone else a wedgie?", 
    
    "Have you ever tried to sneakily give someone a wedgie without them realizing it?", 
    
    "Would you ever get a wedgie in exchange for an embarrassing truth?", 
    
    "Have you ever gotten a wedgie and then tried to laugh it off?", 
    
    "What do you think would happen if you were given a wedgie at a wedding?", 
    
    "Would you ever try to get out of a wedgie by distracting the person who gave it to you?", 
    
    "What would be the most awkward situation to receive a wedgie?", 
    
    "Have you ever regretted giving someone a wedgie after seeing their reaction?", 
    
    "What’s the best way to survive a wedgie at a family gathering?", 
    
    "Would you ever consider a wedgie as a form of friendly greeting?",

    "Describe the most embarrassing wedgie you've ever received.",

"Have you ever given yourself a wedgie on purpose?",

"Would you rather wear wedgied underwear all day or go commando for a week?",

"What's the longest you've ever kept a wedgie in?",

"Have you ever been caught giving yourself a wedgie?",

"Would you rather have a hanging wedgie or an atomic wedgie?",

"Have you ever given a wedgie to someone else?",

"Describe the last wedgie you gave or received.",

"What type of wedgie do you secretly enjoy the most?",

"Would you rather get a wedgie from a friend or a stranger?",

"Have you ever had a wedgie so bad it ripped your underwear?",

"Do you prefer receiving or giving wedgies?",

"Have you ever had a wedgie in public and couldn't fix it?",

"What’s the most creative wedgie you’ve ever experienced?",

"Do you have a favorite pair of underwear for wedgies?",

"Have you ever been wedgied while wearing a thong?",

"Would you rather get a wedgie from one person or multiple people at once?",

"Have you ever used a wedgie as a punishment or bet?",

"What’s the worst wedgie you've ever given someone?",

"Have you ever been hung by your underwear?",

"What's the most humiliating wedgie experience you've had?",

"Have you ever done a wedgie dare?",

"Do you like wedgies that last a long time or quick, intense ones?",

"Have you ever had to cut your underwear off because of a wedgie?",

"Would you rather get a wet wedgie or a frozen wedgie?",

"Have you ever wedgied yourself in front of someone else?",

"Would you rather have a wedgie in public or in private?",

"Have you ever gotten a wedgie in the locker room?",

"Have you ever been wedgied while wearing a swimsuit?",

"What’s your secret wedgie fantasy?",

"Have you ever been double- or triple-teamed for a wedgie?",

"Would you rather get a wedgie every morning or before bed every night?",

"Have you ever lost a game and had to take a wedgie as a consequence?",

"Do you prefer front wedgies or back wedgies?",

"Would you rather have a waistband wedgie or a leg hole wedgie?",

"Have you ever slept in a wedgie?",

"What’s the most extreme wedgie you’ve ever taken?",

"Do you enjoy wedgies more when you're alone or with others?",

"Have you ever worn multiple pairs of underwear to prepare for a wedgie?",

"Would you rather wear underwear that's too big or too small for wedgies?",

"Have you ever been wedgied so hard that your underwear tore in half?",

"Have you ever wedgied someone as a prank, and they actually liked it?",

"What’s the worst wedgie-related injury you’ve had?",

"Have you ever done a wedgie challenge?",

"Would you rather be wedgied over and over or just get one extreme wedgie?",

"Have you ever wedgied yourself on purpose in public?",

"Have you ever given yourself a wedgie and regretted it?",

"Would you rather wear underwear that always gives you a wedgie or never wear underwear again?",

"Have you ever had a wedgie ruin an important event for you?",

"Do you have a wedgie-related memory from childhood that stands out?"

    ],
    "Dares": [
   "Give someone a playful wedgie (if they’re up for it)!", 

   "Pretend to give someone a wedgie, but make it dramatic like it’s the funniest thing ever.", 

   "Do your best impression of someone getting a wedgie.", 

   "Pretend you’re stuck in a wedgie and try to “walk” for 1 minute.", 

   "Jump around while pretending you have a wedgie for 1 minute.", 

   "Give someone a pretend wedgie in the most exaggerated way possible.", 

   "Ask for a wedgie (in a playful way) from someone in the group.", 

   "Walk like a person with an extreme wedgie for 30 seconds.", 

   "Give someone a playful, light wedgie and say, “This is just for fun.”", 

   "Give someone a flirty wink before you pretend to give them a wedgie.", 

   "Playfully “blame” someone else for the wedgie you just gave them.", 

   "Tease someone lightly about the wedgie they gave you.", 

   "Pretend you’re giving someone a wedgie while using a flirty tone.", 

   "Give a playful wedgie to someone, then compliment them afterward.", 

   "Give a “pretend wedgie” to someone while whispering something flirty.",

   "Flirt with someone by acting like you’re about to give them a wedgie.", 

   "Reveal a time when you received an embarrassing wedgie in public.", 

   "Share the most awkward thing you’ve ever done to “hide” a wedgie.", 

   "Confess the most embarrassing thing you’ve done after receiving a wedgie.", 

   "Tell the group about a time you were caught with your pants halfway up due to a wedgie.",

   "Share an awkward or funny story about a wedgie you received unexpectedly.", 

   "Share a moment when you thought you were safe from a wedgie, but it happened anyway.", 

   "Describe the worst wedgie you’ve ever gotten and how you handled it.", 

   "Admit the most embarrassing moment that involved a wedgie.", 

   "Act like you're struggling with the worst wedgie ever for 2 minutes.", 

   "Walk like you’ve been given a wedgie for 1 minute, acting as exaggerated as possible.", 

   "Give someone a “wedgie gesture” without actually touching them, just for fun.", 

   "Pretend you’re stuck in a wedgie for 30 seconds and act it out dramatically.", 

   "Walk around the room for 1 minute like you have an extreme wedgie.", 

   "Demonstrate how you would give someone a wedgie in the funniest way possible.", 

   "Share a “pro tip” for avoiding wedgies when you least expect it.", 

   "Do your best “prankster” impression and pretend to give someone a wedgie without touching them.", 

   "Demonstrate how you would give a wedgie to someone in the funniest possible way.", 

   "Pretend to give yourself a wedgie and dramatically act out the pain.", 

   "Walk around in circles like you’ve got the worst wedgie in history for 2 minutes.", 

   "Act like you’re the victim of a wedgie for 1 minute and explain your “pain.”", 

   "Share the most ridiculous reason you’ve ever given for getting a wedgie.", 

   "Try to untangle a wedgie for 2 minutes and see how successful you are.", 

   "Act like you’re trying to give yourself a wedgie for 1 minute.", 

   "Walk like you’ve been given a wedgie but make it part of an “elegant” fashion show.", 

   "Give someone a “one-inch wedgie” without them knowing.", 

   "Give someone a “soft” wedgie and call it your “signature move.”", 

   "Walk backward for a full minute as if you’ve just received the worst wedgie of your life.", 

   "Pretend to give yourself a wedgie and over-exaggerate your reaction.", 

   "Attempt to “fix” a wedgie without using your hands for 30 seconds.", 

   "Act out what you think the “perfect wedgie moment” looks like.", 

   "Walk around like you’ve just gotten an “atomic wedgie” for 2 minutes.", 

   "Give a dramatic reenactment of someone receiving a wedgie in slow motion.", 

   "Pretend you’re caught in an extreme wedgie for 1 minute and act like it’s causing you immense pain.", 

   "Give someone a playful wedgie while saying something flirty afterward.", 

   "Pretend to give someone a wedgie, but instead of a prank, compliment them afterward.", 

   "Compliment someone in the group and then give them a soft, playful wedgie.", 
  
   "Pretend to give someone a wedgie and whisper a flirty comment in their ear afterward.", 

   "Pretend you’re in love with someone in the group and give them a playful wedgie.", 

   "Give someone a wedgie, then give them a compliment on their style or personality.", 

   "Act like you're a mischievous character who flirts while giving wedgies.", 

   "Flirt with someone and then act like you're about to give them a wedgie—then stop just before!", 

   "Share a time when a wedgie prank went horribly wrong.", 

   "Confess the most awkward thing you’ve done while trying to “fix” a wedgie.", 

   "Reveal the most embarrassing thing you’ve done to get out of a wedgie situation.", 

   "Tell the group about the worst wedgie experience you’ve ever had.", 

   "Share a funny or awkward memory where you accidentally got caught in a wedgie situation.", 

   "Share the most cringeworthy thing you’ve done in the middle of a wedgie prank.", 

   "Tell the group about a time you embarrassed yourself trying to escape from a wedgie.", 

   "Share the most ridiculous “excuse” you’ve given for getting a wedgie.", 

   "Pretend to give yourself a wedgie and act like it’s causing you intense pain.", 

   "Act like you're stuck in a wedgie for 1 minute and call for help dramatically.", 

   "Try to give yourself a wedgie for 30 seconds (without any help!).", 

   "Walk like you’ve got a wedgie for 2 minutes and try to act normal.", 

   "Let someone else give you a soft wedgie and act like you didn’t see it coming.", 

   "Act out what you think the most dramatic “wedgie moment” looks like in slow motion.", 

   "Pretend you’re in a video game and that your character just got a wedgie.", 

   "Make an awkward face like you’ve just received a wedgie and hold it for 30 seconds.", 

   "Pretend to give someone a wedgie but stop at the last second and apologize.", 

   "Walk like you have a wedgie but exaggerate the movement like you're a robot.", 

   "Give a dramatic description of the last time you received a wedgie.", 

   "Act like you're about to give someone the biggest wedgie ever but don’t actually do it.", 

   "Pretend you’re stuck in a wedgie and need to find a way out quickly.", 

   "Give someone a fake wedgie and act like it's going to be the most painful wedgie ever.", 

   "Compliment someone while giving them a wedgie, then act innocent afterward.", 

   "Show everyone how you would “rescue” someone from a wedgie.", 

   "Give someone a wedgie and then make them hop on one foot for 30 seconds.", 

"Give yourself a wedgie and do a dramatic monologue about why you should be the wedgie champion.", 

"Give someone a wedgie and then ask them how they feel about it.", 

"Give someone a wedgie while pretending you’re their personal trainer.", 

"Give yourself a wedgie and then try to keep a straight face while telling a serious story.", 

"Give a wedgie to someone and make them do a silly dance as a consequence.", 

"Give a wedgie and then challenge the victim to a race to see who can get the wedgie fixed first.", 

"Give a wedgie to someone and act like it's a normal greeting between friends.", 

"Give yourself a wedgie and pretend you’re in a commercial for The Wedgie Experience.", 

"Give someone a wedgie and try to get them to laugh while keeping a straight face.", 

"Give a wedgie to someone and ask them to make a dramatic speech about how they feel.", 

"Give a wedgie to someone and then hold it there for 15 seconds while giving them a motivational pep talk.", 

"Give someone a wedgie and then make them wear it while they perform a funny skit.", 

"Give yourself a wedgie and then walk around the room in a tough guy fashion.", 

"Give a wedgie to someone and then take a selfie to commemorate the moment.", 

"Give a wedgie to someone and then give them a “Good luck!” as they walk away.", 

"Givesomeone a wedgie while doing your best impression of a movie villain.", 

"Give a wedgie and then tell the person it’s a rite of passage.", 

"Givesomeone a wedgie and then pretend you’re the leader of a secret wedgie society.", 

"Give a wedgie to someone and then make them do 10 push-ups as a punishment.", 

"Give someone a wedgie while making animal noises.", 

"Give yourself a wedgie and walk around for a minute without adjusting it.", 

"Give a wedgie to someone while singing your favorite song out loud.", 

"Pretend to be stuck in a wedgie for 30 seconds and act like it’s the end of the world.", 

"Give someone a wedgie and hold it there for 20 seconds while telling them a funny story.", 

"Give yourself a wedgie and then do a silly dance to distract everyone.", 

"Pretend to be a wedgie expert and give a detailed tutorial on how to give one.", 

"Give someone a wedgie and then try to walk away without them fixing it.", 

"Give a wedgie to someone and then give them a high-five for being so brave.", 

"Give yourself a wedgie and walk backward for 30 seconds without touching it.", 

"Give someone a wedgie while attempting to sing a song backwards.", 

"Give a wedgie to someone but only pull it halfway and ask them how it feels.", 

"Pretend to be in a wedgie commercial, acting overly dramatic about its benefits.", 

"Give someone a wedgie and then ask them to rate your wedgie-giving skills.", 

"Give a wedgie to someone and then immediately apologize, saying you’re testing out a new move.", 

"Give yourself a wedgie and try to tell a joke without laughing.", 

"Give a wedgie to someone and then make them do 10 jumping jacks while you hold it.", 

"Give yourself a wedgie and then act like it’s an important part of your daily routine.", 

"Give a wedgie to someone and then ask them if it feels like a wedgie of destiny.", 

"Give someone a wedgie while pretending you’re in a superhero movie and this is your special power.",

"Let someone choose underwear for you to wear, then let them give you a wedgie.",

"You have to team up of 2 and wedgie someone in this room together ",

"For People who are wearing panties have to get a group wedgie",

"You have to get a hanging wedgie for 5 Rounds",

"All the Girls gets wedgied by the Boys",

"All the Boys gets wedgied form the girls"

    ]
}
